{
  "about": {
    "name": "Roopesh S",
    "roles": ["SDET", "Data Engineer", "Automation Architect"],
    "objective": "Senior SDET and Quality Engineering specialist with 6+ years of experience architecting scalable automation, cloud data validation frameworks, and DevOps-driven quality pipelines. I engineer reliability into distributed cloud and AI ecosystems, ensuring quality is a foundational component of the architecture, not an afterthought.",
    "resume_link": "Resume.pdf"
  },
  "skills": {
    "Test Automation & Engineering": {
      "UI Automation": [
        "Selenium",
        "Playwright",
        "Cypress"
      ],
      "API & Microservices": [
        "Rest Assured",
        "Postman",
        "Python Requests"
      ],
      "Performance Testing": [
       "JMeter", "BlazeMeter"
      ],
      "Framework Design": [
        "PyTest",
        "Robot Framework",
        "Serenity BDD"
      ],
      "Architecture & Strategy": [
        "End-to-End Automation",
        "Regression Strategy",
        "CI/CD Integration",
        "LLM Testing",
        "RAG Validation",
        "Security Testing",
        "Quality Assurance Audits"
      ]
    },
    "Data & Cloud Quality Engineering": {
      "ETL & Data Validation": [
        "PySpark", "SQL", "NoSQL", "Apache Airflow"
      ],
      "Data Platforms": [
        "Snowflake",  "Azure Databricks", "Azure Data Factory"
      ],
      "Databases visualization": [
        "MS SQL Server", "Teradata", "Denodo", "MySQL", "MongoDB"
      ],
      "Cloud Platforms & Storage": [
        "AWS S3", "Azure DataLake", "Azure Blob Containers", "Cloud Run", "Render", "Oracle Cloud"
      ]
    },
    "DevOps & Infrastructure": {
      "CI/CD Pipelines": [
        "Jenkins", "TeamCity", "Azure DevOps", "Octopus Deploy"
      ],
      "Version Control": [
        "Git", "BitBucket"
      ],
      "Operating Systems": [
        "Linux", "Ubuntu", "Windows", "Mac"
      ]
    },
    "Leadership & Management": {
      "Project & QA Governance": [
        "Test Planning",
        "Documentation",
        "SDLC",
        "STLC",
        "Scrum",
        "Agile",
        "Risk Management",
        "Compliance",
        "Report Generation"
      ],
      "Professional Skills": [
        "Communication",
        "Mentorship",
        "Business Analysis",
        "Team Leadership",
        "Stakeholder Management"
      ]
    }
  },
  "experience": [
    {
      "role": "Automation Engineer",
      "company": "V2Soft Pvt Ltd",
      "tenure": "April 2025 - Present",
      "one_liner": "Led end-to-end Quality Engineering for cloud-native ETL, API, and AI-driven systems — delivering scalable automation architecture, CI/CD-integrated validation, and measurable performance optimization across distributed Azure environments.",
      "responsibilities": [
        "Engineered scalable ETL test automation frameworks using Databricks (PySpark) and Azure Data Factory, achieving 100% validation coverage across complex cloud data pipelines.",
        "Architected performance and load testing suites for high-traffic APIs using JMeter and Postman, fully integrated into CI/CD workflows for production-grade stability.",
        "Delivered a 70% improvement in ETL performance through OOP-driven test architecture redesign and execution optimization.",
        "Implemented real-time quality monitoring and automated reporting using ELK, Jenkins, PyTest, and Azure DevOps across multiple sprint cycles.",
        "Led migration from legacy Java Selenium frameworks to Playwright, significantly enhancing execution speed, reliability, and maintainability.",
        "Automated end-to-end API validation using Serenity BDD, Java, and REST Assured to ensure integrity and security of distributed vehicle cloud data services.",
        "Established structured QA strategies for Generative AI systems, including LLM validation, RAG retrieval evaluation, prompt accuracy testing, and production reliability benchmarking."

      ]
    },
    {
      "role": "Associate Consultant (QA Lead)",
      "company": "DecisionNxt Ltd",
      "tenure": "November 2023 - April 2025",
      "one_liner": "Led strategic Quality Engineering transformation across cloud, data, and AI platforms — architecting automation frameworks, embedding DevOps quality gates, and scaling validation across distributed enterprise systems.",
      "responsibilities": [
        "Spearheaded end-to-end QA transformation initiatives, aligning technical strategy with business goals and transitioning manual processes into scalable, automation-driven engineering workflows.",
        "Architected distributed data validation pipelines using Databricks (PySpark), Azure Data Factory, and Snowflake, ensuring data integrity across Azure Data Lake and AWS EMR environments.",
        "Engineered high-performance 'Gold Master' automation frameworks using Playwright (JavaScript), PyTest/Robot Framework (Python), and Serenity (Java), delivering a 70% increase in execution efficiency.",
        "Integrated automated quality gates into CI/CD pipelines using Jenkins and Azure DevOps, establishing real-time system observability with the ELK Stack for full sprint-level transparency.",
        "Established structured QA frameworks for Generative AI systems, including RAG retrieval evaluation, prompt accuracy validation, and production reliability benchmarking for LLM-based applications.",
        "Orchestrated end-to-end testing across APIs (Rest Assured), performance systems (JMeter), and data layers (Denodo, Teradata), delivering high-reliability cloud services for enterprise and Medical data platforms."

      ]
    },
    {
      "role": "Technology Analyst (Senior Tester)",
      "company": "Infosys Ltd",
      "tenure": "September 2021 - October 2023",
      "one_liner": "Directed enterprise-scale Quality Engineering and DevOps delivery for cloud-native data platforms, optimizing automation frameworks and eliminating data validation blind spots",
      "responsibilities": [
      "Directed end-to-end QA strategy and business-aligned delivery for Indigo Books & Music, managing sprint planning, release validation, production deployments, and stakeholder coordination.",
      "Engineered CI/CD-driven integration pipelines using TeamCity and Octopus Deploy, streamlining delivery of console applications and backend ETL workflows across Azure environments.",
      "Optimized Databricks processing and Azure Functions to eliminate data latency and validation blind spots, improving performance and reliability across Data Lake and Warehouse systems.",
      "Led migration from legacy Selenium frameworks to Playwright, architecting a modern, resilient UI automation ecosystem for web applications.",
      "Designed multi-layered quality strategies spanning API, Cloud, and Security testing, leveraging SQL and NoSQL validation to ensure integrity of complex, unstructured enterprise data systems."

      ]
    },
    {
      "role": "Test Engineer",
      "company": "Sun Technologies Pvt Ltd",
      "tenure": "March 2020 - August 2021",
      "one_liner": "Drove large-scale regression automation and performance validation initiatives, improving execution efficiency by 60% while delivering full-stack and mobile quality assurance across enterprise platforms.",
      "responsibilities": [
        "Increased regression efficiency by 60% within seven months by implementing CI/CD-integrated PyTest and BDD automation frameworks.",
        "Architected full-stack UI and API automation suites using Python (Requests), Java (Selenium, Serenity BDD), and Rest Assured, delivering rapid reporting and comprehensive enterprise test coverage.",
        "Led performance and scalability validation for web and API platforms using JMeter and BlazeMeter, identifying bottlenecks and ensuring stability under high-traffic conditions.",
        "Validated end-to-end mobile application integrity and compliance across Android and iOS ecosystems using structured test management and release validation workflows.",
        "Managed Agile SDLC processes using Jira (Zephyr Scale, Xray), GitHub, and SonarQube, coordinating across distributed 24/7 teams to deliver high-performance releases.",
        "Promoted from Junior Analyst to Level 1 Test Engineer in recognition of strong client satisfaction, technical leadership, and contributions to integration and black-box testing initiatives."

      ]
    }
  ]
  ,
  "projects": [
    {
      "title": "ResuBuild Pro: Dynamic Multi-Template Career Architect",
      "date": "December 2018 - February 2019",
      "description": "A robust PHP-driven platform that automates resume creation. It securely processes user data via a MySQL backend to instantly generate professional profiles across multiple customizable templates.",
      "tags": ["Python","PHP", "HTML","CSS","Javascript"],
      "link": "https://github.com/roopesharch/ResumeEngine"
    },
    {
      "title": "EchoSonic: AI Text-to-Speech Web Application",
      "date": "January 2025 - February 2025",
      "description": "Designed and deployed a production-ready AI text-to-speech web application using FastAPI and ONNX-based Piper voice models. Implemented model preloading, in-memory audio caching, concurrency control, and rate limiting for optimized performance. Hosted frontend on GitHub Pages and backend on cloud infrastructure (Google cloud Run / Oracle Cloud). Integrated playback controls and usage tracking for scalable free-tier deployment.",
      "tags": ["Python","FastAPI","ONNX-based Piper AI models", "HTML","CSS","Javascript"],
      "link": "https://github.com/roopesharch/EchoSonic"
    }
  ],
  "certifications": [
    {"name": "Project Management Fundamentals","provider":"IBM", "year": 2025, "link":"https://www.credly.com/badges/9a06856f-7fb0-45ab-9bc4-2a7908f95987"},
    {"name": "Python Associate Developer","provider":"MongoDB",  "year": 2025, "link":"https://www.credly.com/badges/c2185eaa-9b28-4d37-a417-f96ab62fd233"},
    {"name": "Jenkins Essential Training","provider":"linkedin", "year": 2025, "link":"https://www.linkedin.com/learning/certificates/955001afe9156bb7a5be86511da1f29c33cdbbc8c843a9d63f3915ec7e87813e/?trk=share_certificate&lipi=urn%3Ali%3Apage%3Ad_flagship3_profile_view_base_certifications_details%3BTTejz%2FVtRjKOpVj3giKRrA%3D%3D"}
  ],
  "contact": {
    "email": "roopesharch@gmail.com",
    "phone": "+91 9972572790",
    "location": "Bangalore, India",
    "socials": [
      {"platform": "linkedin", "url": "https://www.linkedin.com/in/roopeh-arch/"},
      {"platform": "github", "url": "https://github.com/roopesharch"}
    ]
  },
  "languages": {
  "Spoken": ["English", "Hindi", "Telugu", "Kannada", "Tamil"],
  "Read & write": ["English", "Hindi", "Telugu", "Kannada"]
    }
}
